app/controllers/admin/galleries_controller.rb

SELECT * FROM `galleries` WHERE (`galleries`.`id` = '1') LIMIT 1
---
  def show
		@gallery = Gallery.find_by_id(params[:id])

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
  def new
		@event = Page.find_by_id(params[:page_id])

INSERT INTO `galleries` (`created_at`, `title`, `updated_at`, `page_id`, `description`) VALUES('2010-05-20 20:24:50', 'test', '2010-05-20 20:24:50', NULL, '<p>test</p>')
---
	def create
	 @gallery = Gallery.new(params[:gallery])
	 respond_to do |format|
		 if @gallery.save

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '1') LIMIT 1
---
  def edit
		@page = Page.find_by_id(params[:page_id])
		@gallery = Gallery.find_by_id(params[:id])

SELECT * FROM `galleries` WHERE (`galleries`.`id` = '1') LIMIT 1
UPDATE `galleries` SET `updated_at` = '2010-07-01 21:23:41', `title` = 'Photo tester' WHERE `id` = 1
---
	def update
	@gallery = Gallery.find_by_id(params[:id])
		respond_to do |format|
		 if @gallery.update_attributes(params[:gallery])

SELECT * FROM `galleries` WHERE (`galleries`.`id` = 2)
DELETE FROM `galleries` WHERE `id` = 2
---
	 def destroy
     @gallery = Gallery.find(params[:id])
     @gallery.destroy