app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
  def index
     @pagetitle = "Admin - Static pages"

		if params[:parent]
			@parent = Page.find_by_id(params[:parent])

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
   def show
     @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
   def edit
     @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `position`, `created_at`, `title`, `body`, `updated_at`, `parent_id`, `navlabel`) VALUES('home', 1, '2010-05-20 18:43:59', 'home', '', '2010-05-20 18:43:59', NULL, 'home')
---
   def create
     @page = Page.new(params[:page])

     respond_to do |format|
       if @page.save

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
UPDATE `pages` SET `updated_at` = '2010-06-07 18:32:27', `body` = '<p>Thank you for your interest. Calpe Junior School is a family run school, established in 1973. The school offers a Co-educational British Curriculum for pupils aged 3 to 10 years, and is situated in a quiet residential location, next to the beach and eucalyptus woods in San Pedro de Alcantara.</p>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-bottom: 10px;\"><img src=\"http://calpe-skool.heroku.com/images/system/all/motto.jpg\" alt=\"motto\" width=\"400\" height=\"250\" /></div>\r\n<p>&nbsp;</p>\r\n<p><strong>Our Aims:</strong></p>\r\n<ol>\r\n<li>To Provide a friendly, happy, safe and stimulating environment.<br /><br /></li>\r\n<li>To enable each child to acheive their full potential as an individual.<br /><br /></li>\r\n<li>Create an atmosphere of trust and caring to enable children to make an effective transition from home to school.<br /><br /></li>\r\n<li>To provide a balanced programme of learning through the British National Curriculum.<br /><br /></li>\r\n<li>To foster intellectual, emotional, moral and cultural development.<br /><br /></li>\r\n<li>To encourage independence and decision making skills.</li>\r\n</ol>' WHERE `id` = 4
---
   def update
     @page = Page.find(params[:id])
     respond_to do |format|
       if @page.update_attributes(params[:page])

SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
DELETE FROM `pages` WHERE `id` = 2
---
   def destroy
     @page = Page.find(params[:id])
     @page.destroy