app/controllers/home_controller.rb

  def index
  	@page = Page.find_by_name(params[:name].gsub(/-/, " "))||Page.find_by_name("homea")
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 4)